jj11hh/ch554_sdcc/examples/usb_cdc_nrf24l01/main.c
    }
}

void GPIOSetup( void ) {
    // Pins:
    // LED:     P3.4 Output
    // IRQ:     P3.2 Input & Interrupt
    // MOSI:    P1.5 Output
    // MISO:    P1.6 Input
    // SCK:     P1.7 Output
    // CE:      P3.1 Output
    // CSN:     P3.0 Output

    P3_DIR_PU = 0b11111011;
    P3_MOD_OC = 0b00000000;
    // Port3: 8 7 6 5 4 3 2 1 0
    // In:                0
    // Out:   1 1 1 1 1 1   1 1

    P1_DIR_PU = 0b110111111;
    P1_MOD_OC = 0b000000000;
    // Port1: 8 7 6 5 4 3 2 1 0
    // In:        0
    // Out:   1 1   1 1 1 1 1 1

    LED = 0; // LED On
    CE = 0;  // Disable TX/RX
}

void USBCDC_SendBytes(const char *buf, uint8_t len) {
    // write upload endpoint
    while (UpPoint2_Busy);
    memcpy(Ep2Buffer + MAX_PACKET_SIZE, buf, len);
    UEP2_T_LEN = len; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

void nRF24_Config( void ){
    nRF24_CE_L();

    nRF24_Init();
    nRF24_DisableAA(0xFF);
    nRF24_SetRFChannel(40);
    nRF24_SetDataRate(nRF24_DR_250kbps);
    nRF24_SetCRCScheme(nRF24_CRC_2byte);
    nRF24_SetAddrWidth(5);
    __code uint8_t nRF24_ADDR0[] = {0x34, 0x43, 0x10, 0x10, 0x01};
    nRF24_SetAddr(nRF24_PIPE0, nRF24_ADDR0);
    nRF24_SetRXPipe(nRF24_PIPE0, nRF24_AA_OFF, 22);
    nRF24_SetOperationalMode(nRF24_MODE_RX);
    nRF24_SetPowerMode(nRF24_PWR_UP);

    nRF24_CE_H();
}

//主函数
void main( void )
{
    __xdata uint32_t Uart_Timeout = 0;
    __xdata uint8_t recievedData[MAX_PACKET_SIZE] ="";
    uint8_t dataRecievedCopFlag = 0 ; 
    uint8_t rcv_buf[32];
    CfgFsys( );                                                           // CH559 clock selection configuration
    mDelaymS(5);                                                          // Modify the main frequency and wait for the internal crystal to stabilize, which must be added
    mInitSTDIO( );                                                        // Serial port 0, can be used for debugging
    GPIOSetup();
    nRF24_Config();

#ifdef DE_PRINTF
    printf("start ...\n");
#endif
    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared
    
    while(1)
    {
        if(UsbConfig)
        {
            Uart_Timeout++;
            if(!UpPoint2_Busy)   // The endpoint is not busy (the first packet of data after idle, only used to trigger upload)
            {
                uint8_t len;

                if (nRF24_GetStatus_RXFIFO() != nRF24_STATUS_RXFIFO_EMPTY){
                    nRF24_ReadPayload(rcv_buf, &len);
                    nRF24_ClearIRQFlags();
                    USBCDC_SendBytes(rcv_buf, len);
                }
                if(Uart_Timeout>100000)
                {
                    Uart_Timeout = 0;
                    USBCDC_SendBytes("Hello\r\n", 7);
                    LED = ! LED;
                }
            }
        }
    }
}
